# S6: Librería Pandas

 La librería Pandas desarrollada para el análisis. Fue desarrollada en NumPy. La librería Pandas trae la riqueza de R al mundo de Python. Tiene eficiente estructuras de datos para procesar los datos, unir datos y leerlos de varias fuentes.

## Series

Una **serie** en Pandas es un vector unidimensional con un índice que puede especificarse o no.

In [2]:
# Importar la librería Pandas desde Python.
import pandas as pd
import numpy as np

In [ ]:
# Creación de una serie a partir de 5 números aleatorios.
pd.Series(np.random.randn(5))

In [ ]:
ser_1 = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [ ]:
ser_1

In [ ]:
ser_1['c']

In [ ]:
ser_1[2]

In [ ]:
ser_1[1:4]

## Data Frames

Un **DataFrame** son estructuras bidimensionales donde las columnas está etiquetadas con su valor y pueden ser de tipos distintos. Una analogía a un Dataframe podria ser una hoja de cálculo Excel o una tabla de una base de datos.

De forma opcional un Dataframe puede tener un ínidce. Ese ínidce será el nombre de las filas.

In [4]:
# Data Frames que provienen de diccionarios de series.
d = {'c1': pd.Series(['A', 'B', 'C']),'c2': pd.Series([1., 2., 3., 4.])}
data1 = pd.DataFrame(d)
data1

    c1   c2
0    A  1.0
1    B  2.0
2    C  3.0
3  NaN  4.0

In [5]:
# Data Frames que provienen de diccionarios de listas.
d = {'c1': ['A', 'B', 'C', 'D'],'c2': [1.0, 2.0, 3.0, 4.0]}
data2 = pd.DataFrame(d)
display(data2)
print(type(data2))

  c1   c2
0  A  1.0
1  B  2.0
2  C  3.0
3  D  4.0

<class 'pandas.core.frame.DataFrame'>

In [6]:
#date_range genera una lista de fechas.
dates = pd.date_range('20130101',periods=6)
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
#index=> es el índice y indica el nombre de cada fila. en este caso metemos
#el array de dates del paso anterior. Columns identifica la etiqueta de las
#columnas.
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.783404 -0.382027  0.013084 -2.085420
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-03  0.023264  0.510551  0.965004  0.057420
2013-01-04  1.144984 -1.337211  1.707353  0.220650
2013-01-05  1.334982  1.687219  1.021728  1.741000
2013-01-06  0.228943  0.081658  0.574857  1.310302

In [8]:
#También lo podemos imprimir más bonito (solamente en Jupyter)
display(df)

                   A         B         C         D
2013-01-01 -0.783404 -0.382027  0.013084 -2.085420
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-03  0.023264  0.510551  0.965004  0.057420
2013-01-04  1.144984 -1.337211  1.707353  0.220650
2013-01-05  1.334982  1.687219  1.021728  1.741000
2013-01-06  0.228943  0.081658  0.574857  1.310302

Los tipos de datos de un dataframe pueden ser diferentes. Es la misma idea que una tabla de la base de datos. Cada columna puede ser de un tipo diferente.

In [9]:
serie = pd.Series(42,index=list(range(4)))
display(serie)

0    42
1    42
2    42
3    42
dtype: int64

In [10]:

df2 = pd.DataFrame({'A':1.0,
                    'B':pd.Timestamp('20130102'),
                    'C':pd.Series(42,index=list(range(4)),dtype='float32'),
                    'D':2,
                    'E':pd.Categorical(['test','train','test','train']),
                    'F': "foo" 
                   })
display(df2)
print(df2.dtypes)

     A          B     C  D      E    F
0  1.0 2013-01-02  42.0  2   test  foo
1  1.0 2013-01-02  42.0  2  train  foo
2  1.0 2013-01-02  42.0  2   test  foo
3  1.0 2013-01-02  42.0  2  train  foo

A           float64
B    datetime64[ns]
C           float32
D             int64
E          category
F            object
dtype: object

Veamos algunas funciones útiles:
* pd.Timestamp(): genera una campo de tipo timestamp.
* pd.Series() Genera una serie de números. El index es el índice de la serie que es de tipo entero. Range genera los 4 primeros números.
* pd.Categorical() genera una lista de categorías.

A continuación se muestran diversas funciones útiles para acceder a las 
características de un DataFrame

In [11]:
print(df.index)
print('----------------------------------------')
print(df.columns)
print('----------------------------------------')
print(df.values)
print('----------------------------------------')
display(df)
print("=========================================")
print(df.describe())    #principales estadisticos de un dataframe

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')
----------------------------------------
Index(['A', 'B', 'C', 'D'], dtype='object')
----------------------------------------
[[-0.78340396 -0.38202658  0.01308446 -2.08541981]
 [ 0.34648947  1.60321774  0.71179439  0.73291793]
 [ 0.02326424  0.51055059  0.96500392  0.05741995]
 [ 1.14498426 -1.33721142  1.70735333  0.22064956]
 [ 1.33498197  1.68721882  1.02172833  1.74100029]
 [ 0.2289432   0.08165842  0.57485732  1.31030233]]
----------------------------------------

                   A         B         C         D
2013-01-01 -0.783404 -0.382027  0.013084 -2.085420
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-03  0.023264  0.510551  0.965004  0.057420
2013-01-04  1.144984 -1.337211  1.707353  0.220650
2013-01-05  1.334982  1.687219  1.021728  1.741000
2013-01-06  0.228943  0.081658  0.574857  1.310302

=========================================
              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.382543  0.360568  0.832304  0.329478
std    0.774837  1.169476  0.560558  1.344230
min   -0.783404 -1.337211  0.013084 -2.085420
25%    0.074684 -0.266105  0.609092  0.098227
50%    0.287716  0.296105  0.838399  0.476784
75%    0.945361  1.330051  1.007547  1.165956
max    1.334982  1.687219  1.707353  1.741000

In [ ]:
df

In [12]:
#dataframe transpuesto
display(df.T)

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.783404    0.346489    0.023264    1.144984    1.334982    0.228943
B   -0.382027    1.603218    0.510551   -1.337211    1.687219    0.081658
C    0.013084    0.711794    0.965004    1.707353    1.021728    0.574857
D   -2.085420    0.732918    0.057420    0.220650    1.741000    1.310302

## Ordenación

In [13]:
#Ordenar por índices
display(df)
display(df.sort_index(axis=0,ascending=False)) # ordena las filas (axis 0)
display(df.sort_index(axis=1,ascending=False)) # ordena las columnas (axis 1)

                   A         B         C         D
2013-01-01 -0.783404 -0.382027  0.013084 -2.085420
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-03  0.023264  0.510551  0.965004  0.057420
2013-01-04  1.144984 -1.337211  1.707353  0.220650
2013-01-05  1.334982  1.687219  1.021728  1.741000
2013-01-06  0.228943  0.081658  0.574857  1.310302

                   A         B         C         D
2013-01-06  0.228943  0.081658  0.574857  1.310302
2013-01-05  1.334982  1.687219  1.021728  1.741000
2013-01-04  1.144984 -1.337211  1.707353  0.220650
2013-01-03  0.023264  0.510551  0.965004  0.057420
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-01 -0.783404 -0.382027  0.013084 -2.085420

                   D         C         B         A
2013-01-01 -2.085420  0.013084 -0.382027 -0.783404
2013-01-02  0.732918  0.711794  1.603218  0.346489
2013-01-03  0.057420  0.965004  0.510551  0.023264
2013-01-04  0.220650  1.707353 -1.337211  1.144984
2013-01-05  1.741000  1.021728  1.687219  1.334982
2013-01-06  1.310302  0.574857  0.081658  0.228943

In [14]:
#Ordenar por columnas
display(df)
display(df.sort_values(by=['C'],ascending=False)) 
# selecciona la columna que utilizaremos como criterio de ordenación

                   A         B         C         D
2013-01-01 -0.783404 -0.382027  0.013084 -2.085420
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-03  0.023264  0.510551  0.965004  0.057420
2013-01-04  1.144984 -1.337211  1.707353  0.220650
2013-01-05  1.334982  1.687219  1.021728  1.741000
2013-01-06  0.228943  0.081658  0.574857  1.310302

                   A         B         C         D
2013-01-04  1.144984 -1.337211  1.707353  0.220650
2013-01-05  1.334982  1.687219  1.021728  1.741000
2013-01-03  0.023264  0.510551  0.965004  0.057420
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-06  0.228943  0.081658  0.574857  1.310302
2013-01-01 -0.783404 -0.382027  0.013084 -2.085420

Las funciones head y tail nos muestran los primeros y últimos elementos respectivamente. Útiles para resumir el dataframe cuanod estos son muy grandes.

In [15]:
display(df.head(3))
display(df.tail(3))

                   A         B         C         D
2013-01-01 -0.783404 -0.382027  0.013084 -2.085420
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-03  0.023264  0.510551  0.965004  0.057420

                   A         B         C         D
2013-01-04  1.144984 -1.337211  1.707353  0.220650
2013-01-05  1.334982  1.687219  1.021728  1.741000
2013-01-06  0.228943  0.081658  0.574857  1.310302

#### Acceder a una columna.

In [16]:
display(df[['B']])
display(df.B) # Ojo con los nombres de las columnas que sea palabras con espacio

                   B
2013-01-01 -0.382027
2013-01-02  1.603218
2013-01-03  0.510551
2013-01-04 -1.337211
2013-01-05  1.687219
2013-01-06  0.081658

2013-01-01   -0.382027
2013-01-02    1.603218
2013-01-03    0.510551
2013-01-04   -1.337211
2013-01-05    1.687219
2013-01-06    0.081658
Freq: D, Name: B, dtype: float64

#### Acceder a una fila.

In [19]:
display(df)
display(df[1:4])
display(df['2013-01-02':'2013-01-04']) # selección por filas con un rango de numpy

                   A         B         C         D
2013-01-01 -0.783404 -0.382027  0.013084 -2.085420
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-03  0.023264  0.510551  0.965004  0.057420
2013-01-04  1.144984 -1.337211  1.707353  0.220650
2013-01-05  1.334982  1.687219  1.021728  1.741000
2013-01-06  0.228943  0.081658  0.574857  1.310302

                   A         B         C         D
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-03  0.023264  0.510551  0.965004  0.057420
2013-01-04  1.144984 -1.337211  1.707353  0.220650

                   A         B         C         D
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-03  0.023264  0.510551  0.965004  0.057420
2013-01-04  1.144984 -1.337211  1.707353  0.220650

La función **loc()** define una selección a traves de un indice. Selecciona por filas en función del indice

In [20]:
display(df)
display(df.loc[[dates[1]]])   #el doble corchete convierte la salida en un dataframe
display(df.loc[['2013-01-02']])
display(df.loc[:,['A','B']]) #selecciona todas las filas y las columnas A y B
display(df.loc['2013-01-01':'2013-01-02',['A','B']]) #selecciona las filas '2013-01-01' a '2013-01-02' y las columnas A y B

                   A         B         C         D
2013-01-01 -0.783404 -0.382027  0.013084 -2.085420
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-03  0.023264  0.510551  0.965004  0.057420
2013-01-04  1.144984 -1.337211  1.707353  0.220650
2013-01-05  1.334982  1.687219  1.021728  1.741000
2013-01-06  0.228943  0.081658  0.574857  1.310302

                   A         B         C         D
2013-01-02  0.346489  1.603218  0.711794  0.732918

                   A         B         C         D
2013-01-02  0.346489  1.603218  0.711794  0.732918

                   A         B
2013-01-01 -0.783404 -0.382027
2013-01-02  0.346489  1.603218
2013-01-03  0.023264  0.510551
2013-01-04  1.144984 -1.337211
2013-01-05  1.334982  1.687219
2013-01-06  0.228943  0.081658

                   A         B
2013-01-01 -0.783404 -0.382027
2013-01-02  0.346489  1.603218

**iloc()** es similar, pero utiliza enteros en vez de los nombres de los campos (podemos aplicar indexing y slicing).

In [21]:
display(df.iloc[3])    # devuelve como resultado una serie
display(df.iloc[[3]])    # devuelve como resultado un dataframe
display(df.iloc[0:2,0:2])
display(df.iloc[[1,2,4],[0,2,3]])
display(df.iloc[:,[0,2,3]])
display(df.iloc[[0,2,4],:])

A    1.144984
B   -1.337211
C    1.707353
D    0.220650
Name: 2013-01-04 00:00:00, dtype: float64

                   A         B         C        D
2013-01-04  1.144984 -1.337211  1.707353  0.22065

                   A         B
2013-01-01 -0.783404 -0.382027
2013-01-02  0.346489  1.603218

                   A         C         D
2013-01-02  0.346489  0.711794  0.732918
2013-01-03  0.023264  0.965004  0.057420
2013-01-05  1.334982  1.021728  1.741000

                   A         C         D
2013-01-01 -0.783404  0.013084 -2.085420
2013-01-02  0.346489  0.711794  0.732918
2013-01-03  0.023264  0.965004  0.057420
2013-01-04  1.144984  1.707353  0.220650
2013-01-05  1.334982  1.021728  1.741000
2013-01-06  0.228943  0.574857  1.310302

                   A         B         C        D
2013-01-01 -0.783404 -0.382027  0.013084 -2.08542
2013-01-03  0.023264  0.510551  0.965004  0.05742
2013-01-05  1.334982  1.687219  1.021728  1.74100

**Filtrado condicional:** Similar a select where condition de sql. Permite consular solo los valores que cumplan con la condición.

In [22]:
display(df)
display(df[df.B > 0]) # muestra los valores de la tabla en cuya columna B su valor sea mayor que 0
display(df[df > 0]) # muestra los elementos de la tabla que sean mayores que cero. El resto serán NaN

                   A         B         C         D
2013-01-01 -0.783404 -0.382027  0.013084 -2.085420
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-03  0.023264  0.510551  0.965004  0.057420
2013-01-04  1.144984 -1.337211  1.707353  0.220650
2013-01-05  1.334982  1.687219  1.021728  1.741000
2013-01-06  0.228943  0.081658  0.574857  1.310302

                   A         B         C         D
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-03  0.023264  0.510551  0.965004  0.057420
2013-01-05  1.334982  1.687219  1.021728  1.741000
2013-01-06  0.228943  0.081658  0.574857  1.310302

                   A         B         C         D
2013-01-01       NaN       NaN  0.013084       NaN
2013-01-02  0.346489  1.603218  0.711794  0.732918
2013-01-03  0.023264  0.510551  0.965004  0.057420
2013-01-04  1.144984       NaN  1.707353  0.220650
2013-01-05  1.334982  1.687219  1.021728  1.741000
2013-01-06  0.228943  0.081658  0.574857  1.310302

**Cruzado de datos (merge)** similar a la que se puede hacer en BBDD con join.

In [23]:
tabla1 = pd.DataFrame({'key1' : ['A','B','C','D'], 'lval':[1,2,3,4]})
tabla2 = pd.DataFrame({'key2' : ['C','D','E','F'], 'rval':[5,6,7,8]})
tabla3 = pd.DataFrame({'key2' : ['C','D','E','F'], 'rval':[5,6,7,8]})
display(tabla1)
display(tabla2)
new1 = pd.merge(tabla1,tabla2,left_on='key1',right_on='key2', how="left").merge(tabla3, left_index=True, right_index=True)  
# si el campo para fusionar se llam igual en ambas tablas, basta con poner on=" "
#how : forma en la que combinamos con una intersección o con una unión, 
#sólo con la izquierda o sólo con la tabla de la derecha
#left, right, inner o outher.
display(new1)

  key1  lval
0    A     1
1    B     2
2    C     3
3    D     4

  key2  rval
0    C     5
1    D     6
2    E     7
3    F     8

  key1  lval key2_x  rval_x key2_y  rval_y
0    A     1    NaN     NaN      C       5
1    B     2    NaN     NaN      D       6
2    C     3      C     5.0      E       7
3    D     4      D     6.0      F       8

Para hacer agrupaciones, podemos usar **groupby**

In [24]:
f = pd.DataFrame({'A' : ['foo', 'bar'] * 12,
                   'B' : ['one', 'two', 'three']*8,
                   'val1' : np.random.rand(24),
                   'val2' : np.random.rand(24)})
display(f)

      A      B      val1      val2
0   foo    one  0.248604  0.837806
1   bar    two  0.166628  0.901392
2   foo  three  0.680027  0.075803
3   bar    one  0.656096  0.953693
4   foo    two  0.095428  0.802446
5   bar  three  0.886942  0.354192
6   foo    one  0.523445  0.386612
7   bar    two  0.346873  0.736714
8   foo  three  0.877610  0.097541
9   bar    one  0.439410  0.343830
10  foo    two  0.239029  0.266355
11  bar  three  0.823842  0.611532
12  foo    one  0.699610  0.177660
13  bar    two  0.755934  0.379704
14  foo  three  0.803062  0.328130
15  bar    one  0.307304  0.979433
16  foo    two  0.371203  0.541013
17  bar  three  0.433983  0.899536
18  foo    one  0.388154  0.634218
19  bar    two  0.063899  0.101873
20  foo  three  0.031991  0.427689
21  bar    one  0.232170  0.343333
22  foo    two  0.791543  0.342918
23  bar  three  0.272065  0.078088

In [25]:
group = f.groupby(['A','B'])
print("-------------")
display(group)

-------------

In [26]:
# los grupos no se pueden mostrar, 
# group está pensado para ejecutar posteriormente una acción
# por ejemplo sumar
print("-----suma agrupada------")
display(group.sum())
print("-----estadisticos agrupados------")
display(group.describe())

-----suma agrupada------

               val1      val2
A   B
bar one    1.634980  2.620290
    three  2.416833  1.943348
    two    1.333334  2.119684
foo one    1.859813  2.036296
    three  2.392690  0.929162
    two    1.497203  1.952732

-----estadisticos agrupados------

           val1                                                              \
          count      mean       std       min       25%       50%       75%
A   B
bar one     4.0  0.408745  0.185824  0.232170  0.288520  0.373357  0.493582
    three   4.0  0.604208  0.298593  0.272065  0.393503  0.628912  0.839617
    two     4.0  0.333334  0.305046  0.063899  0.140946  0.256751  0.449138
foo one     4.0  0.464953  0.192519  0.248604  0.353266  0.455799  0.567486
    three   4.0  0.598172  0.386146  0.031991  0.518018  0.741544  0.821699
    two     4.0  0.374301  0.300094  0.095428  0.203129  0.305116  0.476288

                     val2                                                    \
                max count      mean       std       min       25%       50%
A   B
bar one    0.656096   4.0  0.655072  0.359832  0.343333  0.343706  0.648762
    three  0.886942   4.0  0.485837  0.351443  0.078088  0.285166  0.482862
    two    0.755934   4.0  0.529921  0.358954  0.101873  0.310246  0.558209
foo one    0.699610   4.0  0.509074  0.287842  0.177660  0.334374  0.510415
    three  0.877610   4.0  0.232291  0.173216  0.075803  0.092106  0.212835
    two    0.791543   4.0  0.488183  0.239347  0.266355  0.323778  0.441966


                75%       max
A   B
bar one    0.960128  0.979433
    three  0.683533  0.899536
    two    0.777883  0.901392
foo one    0.685115  0.837806
    three  0.353019  0.427689
    two    0.606371  0.802446

Una agrupación directa:

In [27]:
f.groupby(['A','B']).sum()

               val1      val2
A   B
bar one    1.634980  2.620290
    three  2.416833  1.943348
    two    1.333334  2.119684
foo one    1.859813  2.036296
    three  2.392690  0.929162
    two    1.497203  1.952732

Ahora aplicamos un filtro sobre una agrupación (similar al having de SQL):

In [28]:
agrup = f.groupby(['A','B']).sum()
agrup[agrup.val1 > 2]

               val1      val2
A   B
bar three  2.416833  1.943348
foo three  2.392690  0.929162

Pero veo que existe un método llamado **join()**. ¿Tienen la misma funcionalidad?

In [29]:
tabla1.set_index('key1').join(tabla2.set_index('key2'))

      lval  rval
key1
A        1   NaN
B        2   NaN
C        3   5.0
D        4   6.0

In [31]:
tabla1.set_index('key1').join(tabla2.set_index('key2'),how="inner")

   lval  rval
C     3     5
D     4     6

Pues la respuesta es que **`No`**. El método `join()` se usa cuando se quiere cruzar dos DataFrames en base a sus índices o en base al(a los) índice(s) de un DataFrame con la(s) columna(s) de la otra.

¿Te acuerdas de las tablas dinámicas de Excel? Pues, DataFrame tiene una funcionalidad parecida.

In [ ]:
f

In [ ]:
f.pivot_table(index="A", columns="B", values="val1", aggfunc="mean", margins=True, margins_name='Total')

### Programación Funcional con Pandas
Las funciones `lambda`, `map` y `filter` vistas en los notebooks anteriores, son utilizadas por los DataFrames.

##### Lambda

In [34]:
# Defino una función lambda para poder sumar una unidad a un valor
potencia = lambda x: x**2

In [35]:
# Sumar una unidad a una columna
f["val1"].apply(potencia)

0     0.061804
1     0.027765
2     0.462436
3     0.430462
4     0.009107
5     0.786667
6     0.273995
7     0.120321
8     0.770199
9     0.193081
10    0.057135
11    0.678716
12    0.489455
13    0.571436
14    0.644908
15    0.094435
16    0.137792
17    0.188341
18    0.150663
19    0.004083
20    0.001023
21    0.053903
22    0.626540
23    0.074020
Name: val1, dtype: float64

¿Puedo hacer operaciones con más de una columna?

In [36]:
fraccion = lambda row: round(row["val1"] / row["val2"], 2) if row["val2"] > 0 else 0

In [37]:
f["fraccion"] = f.apply(fraccion, axis=1)
f

      A      B      val1      val2  fraccion
0   foo    one  0.248604  0.837806      0.30
1   bar    two  0.166628  0.901392      0.18
2   foo  three  0.680027  0.075803      8.97
3   bar    one  0.656096  0.953693      0.69
4   foo    two  0.095428  0.802446      0.12
5   bar  three  0.886942  0.354192      2.50
6   foo    one  0.523445  0.386612      1.35
7   bar    two  0.346873  0.736714      0.47
8   foo  three  0.877610  0.097541      9.00
9   bar    one  0.439410  0.343830      1.28
10  foo    two  0.239029  0.266355      0.90
11  bar  three  0.823842  0.611532      1.35
12  foo    one  0.699610  0.177660      3.94
13  bar    two  0.755934  0.379704      1.99
14  foo  three  0.803062  0.328130      2.45
15  bar    one  0.307304  0.979433      0.31
16  foo    two  0.371203  0.541013      0.69
17  bar  three  0.433983  0.899536      0.48
18  foo    one  0.388154  0.634218      0.61
19  bar    two  0.063899  0.101873      0.63
20  foo  three  0.031991  0.427689      0.07
21  bar    one  0.232170  0.343333      0.68
22  foo    two  0.791543  0.342918      2.31
23  bar  three  0.272065  0.078088      3.48

##### Map
Nos permite asociar un valor con otro

In [38]:
f["B"].unique().tolist()

['one', 'two', 'three']

In [ ]:
ingreso_rng_dict = {v: k for k, v in enumerate(f["B"].unique().tolist())}
ingreso_rng_dict

In [ ]:
f["B_COD"] = f["B"].map(ingreso_rng_dict)
f

##### Filter
Nos permite filtrar en base a los índices en cualquiera de los axis.

In [39]:
f.filter(items=["A", "B"], axis=1)

      A      B
0   foo    one
1   bar    two
2   foo  three
3   bar    one
4   foo    two
5   bar  three
6   foo    one
7   bar    two
8   foo  three
9   bar    one
10  foo    two
11  bar  three
12  foo    one
13  bar    two
14  foo  three
15  bar    one
16  foo    two
17  bar  three
18  foo    one
19  bar    two
20  foo  three
21  bar    one
22  foo    two
23  bar  three

In [ ]:
# Filtrar solo las columnas que empiecen con B
f.filter(like="B", axis=1)

### SQL - WHERE column_name LIKE '%o%'

In [40]:
f[f['B'].str.contains('o')]

      A    B      val1      val2  fraccion
0   foo  one  0.248604  0.837806      0.30
1   bar  two  0.166628  0.901392      0.18
3   bar  one  0.656096  0.953693      0.69
4   foo  two  0.095428  0.802446      0.12
6   foo  one  0.523445  0.386612      1.35
7   bar  two  0.346873  0.736714      0.47
9   bar  one  0.439410  0.343830      1.28
10  foo  two  0.239029  0.266355      0.90
12  foo  one  0.699610  0.177660      3.94
13  bar  two  0.755934  0.379704      1.99
15  bar  one  0.307304  0.979433      0.31
16  foo  two  0.371203  0.541013      0.69
18  foo  one  0.388154  0.634218      0.61
19  bar  two  0.063899  0.101873      0.63
21  bar  one  0.232170  0.343333      0.68
22  foo  two  0.791543  0.342918      2.31

### SQL - WHERE column_name LIKE 'o%'

In [41]:
f[f['B'].str.startswith('o')]

      A    B      val1      val2  fraccion
0   foo  one  0.248604  0.837806      0.30
3   bar  one  0.656096  0.953693      0.69
6   foo  one  0.523445  0.386612      1.35
9   bar  one  0.439410  0.343830      1.28
12  foo  one  0.699610  0.177660      3.94
15  bar  one  0.307304  0.979433      0.31
18  foo  one  0.388154  0.634218      0.61
21  bar  one  0.232170  0.343333      0.68

### SQL - WHERE column_name LIKE '%e'

In [ ]:
f[f['B'].str.endswith('e')]

## Importar y exportar datos en formato csv y txt

In [ ]:
# Importar datos en formato csv.
d_students = pd.read_csv('data/students.csv', sep=',')

In [ ]:
# Leer los primeros registros
d_students.head(3)

In [ ]:
# Importar datos en formato txt.
d_txt = pd.read_csv('data/students.txt', sep='|')

In [ ]:
d_txt.head(3)

### Exportar datos de un data frame a un csv y txt

In [ ]:
display(f)

In [ ]:
f.to_csv('prueba.csv', sep=',', index=False)

In [ ]:
f.to_csv('prueba.txt', sep='|', index=False)

### Ejemplo de uso de **read_csv** con *parse_dates*

In [ ]:
dateparse = lambda x: pd.datetime.strptime(x, '%Y %m') # depende del formato que tenga la fecha en tu archivo
data = pd.read_csv("data/AirPassengers_2012_2016_2.csv", parse_dates= {'yearmonth':['Year', 'Month']}, date_parser=dateparse,index_col='yearmonth')
data.head()

### Valores como cabeceras de las columnas en lugar de nombres de variables

In [ ]:
import pandas as pd
incomes_per_religion = pd.read_csv("data/religion_income.csv")
incomes_per_religion.head()

In [ ]:
incomes_per_religion_tidy = pd.melt(incomes_per_religion, 
    id_vars=['religion'], var_name='income', value_name='frequency')
incomes_per_religion_tidy.set_index('religion',inplace=True)
incomes_per_religion_tidy.sort_index().head(10)

## Importar y exportar datos en formato xls

In [ ]:
# Importar datos en formato xls.
d = pd.read_excel('data/students.xls')

In [ ]:
# ordenando por algún campo específico
d.sort_values('AREA NAME', ascending=False).head(3)

In [ ]:
billboard = pd.read_excel("data/billboard.xlsx")
billboard.head(10)

In [ ]:
songs_cols = ["year", "artist.inverted", "track", "time", "genre"]
songs = billboard[songs_cols].drop_duplicates() # Eliminamos posibles duplicados
songs = songs.reset_index(drop=True) # Se reinicia el índice eliminando el antiguo
songs["song_id"] = songs.index
songs.head()

### Exportar datos de un data frame a formato Excel

In [ ]:
songs.to_excel("data/canciones.xlsx")

## Importar datos en formato JSON

In [ ]:
# Importar el paquete JSON.
import json

In [ ]:
json_data = open('data/students.json')

In [ ]:
data = json.load(json_data)

In [ ]:
data

In [ ]:
json_data.close()

### Juntar varias tablas con nombres consecutivos

In [ ]:
df1 = pd.read_csv('data/religion_income_1.csv')
df1

In [ ]:
df2 = pd.read_csv('data/religion_income_2.csv')
df2

In [ ]:
from glob import glob

#permite juntar varias tablas con nombres consecutivos
filenames = glob('data/religion_income_*.csv')
dataframes = []
dataframes = [pd.read_csv(f) for f in filenames]
df3 = pd.concat(dataframes)
df3

In [ ]:
df3.reset_index(inplace=True)
df3

# Data Cleansing

## Valores perdidos

In [ ]:
# Identificar a los valores perdidos.
d_students['REGION'].isnull().value_counts()

In [ ]:
# Identificar a los valores no perdidos.
d_students['PCT OVERWEIGHT'].notnull().value_counts()

In [ ]:
# Cuantificar a los valores perdidos.
d_students['PCT OVERWEIGHT'].isnull().value_counts()

In [ ]:
# Cuantificar a los valores no perdidos.
d_students['PCT OVERWEIGHT'].notnull().value_counts()

In [ ]:
# Eliminar a los valores perdidos.
d_students['PCT OVERWEIGHT'].dropna().head(20)

In [ ]:
d_students.head(20)

In [ ]:
# Eliminar a cualquier registro que tenga por lo menos un campo con valor perdido: how='any'
# Para eliminar filas completas con valores todos los valores vacíos: how='all'
d = d_students.dropna(how='any')

In [ ]:
d.head(20)

In [ ]:
# Cuantificar a los valores perdidos.
d['PCT OVERWEIGHT'].isnull().value_counts()

## Imputar Valores Perdidos

In [ ]:
# Crear un data frame en base a números aleatorios.
df = pd.DataFrame(np.random.randn(5, 3), index=['a0', 'a10','a20', 'a30', 'a40'],columns=['X', 'Y', 'Z'])
df

In [ ]:
# Crear índices adicionales al data frame.
df2 = df.reindex(['a0', 'a1', 'a10', 'a11', 'a20', 'a21','a30', 'a31', 'a40', 'a41'])
df2

In [ ]:
# Completar los valores perdidos con ceros.
df3 = df2.fillna(0)
df3

In [ ]:
# Completar los valores con valores diferentes por variable mediante un diccionario
values = {'X': 10, 'Y': 20, 'Z': 30}
df4 = df2.fillna(values)
df4

In [ ]:
# Completar los valores perdidos con el método “forward propagation”. Se va completar con el valor previo al nulo.
df5 = df2.fillna(method='pad')
df5

In [ ]:
# Completar los valores perdidos con el promedio de la variable.
df6 = df2.fillna(df2.mean())
df6

In [ ]:
# Completar los valores perdidos con la mediana de determinadas variables.
df7 = df2[['X','Y']].fillna(df2[['X','Y']].median())
df7

# Extra 1: 

## Trabajando con un DataFrame

In [ ]:
# Importar un archivo csv y leer los 5 primeros casos.
df = pd.read_csv('data/students.csv')
df['AREA NAME'][0:5]

In [ ]:
df[['GRADE LEVEL']]

In [ ]:
df['GRADE LEVEL'] == 'ELEMENTARY'

In [ ]:
# Filtrar casos específicos.
df[(df['GRADE LEVEL'] == 'ELEMENTARY') & (df['COUNTY'] == 'YATES')]

In [ ]:
df[['COUNTY','AREA NAME']][0:5]

In [ ]:
# Convertir a mayúsculas.
df['AREA NAME'][0:5].str.upper()

In [ ]:
# Convertir a minúsculas.
df['AREA NAME'][0:5].str.lower()

In [ ]:
# Convertir a minúsculas.
df['AREA NAME'][0:5].str.title()

In [ ]:
# Cuantificar la cantidad de caracteres de cada elemento.
df['AREA NAME'][0:5].str.len()

In [ ]:
# Cortar en base a espacios en blanco.
df['AREA NAME'][0:5].str.split(' ')

In [ ]:
# Cortar en base a espacios en blanco.
df['AREA NAME'][0:5].str.split(' ').str.get(0)

In [ ]:
# Reemplazar
df['AREA NAME'][0:5].str.replace('DISTRICT$', 'DIST')

In [ ]:
df['AREA NAME'][0:5].str.strip()

In [ ]:
help(df['AREA NAME'][0:5].str)

# Extra 2:

## Concatenación de DataFrames

In [ ]:
# Seleccionamos los 5 primeros registros de 2 campos.
d[['AREA NAME', 'COUNTY']][0:5]

In [ ]:
# Partir los datos en dos grupos. Concatenarlos por posición.
p1 = d[['AREA NAME', 'COUNTY']][0:2] 
p1

In [ ]:
p2 = d[['AREA NAME', 'COUNTY']][2:5]
p2

In [ ]:
pd.concat([p1,p2])

In [ ]:
# Concatenar datos en base a una llave.
concatenated = pd.concat([p1,p2], keys = ['p1','p2'])
concatenated.head()

In [ ]:
# Seleccionar la data agregada en base a una llave.
concatenated.loc['p1']

In [ ]:
# Seleccionamos un subconjunto de elementos y promediamos.
data = df[df['GRADE LEVEL'] == 'ELEMENTARY']
data.head()

In [ ]:
data.mean()

In [ ]:
df.info()

In [ ]:
df['ZIP CODE'] = df['ZIP CODE'].astype(str)

In [ ]:
df.info()

In [ ]:
data['NO. OBESE'].mean()

In [ ]:
data['NO. OBESE'].median()

In [ ]:
# La suma total.
data['NO. OBESE'].sum()

In [ ]:
# Valor máximo.
data['NO. OBESE'].max()

In [ ]:
# Valor mínimo.
data['NO. OBESE'].min()

In [ ]:
# Desviación Estándar.
data['NO. OBESE'].std()

In [ ]:
# Conteo.
data = df[(df['GRADE LEVEL'] == 'ELEMENTARY') &(df['COUNTY'] == 'DELAWARE')]
data['COUNTY'].count()

In [ ]:
data[['CITY','LOCATION CODE']]

In [ ]:
data.count()

In [ ]:
# Crear datos
grade_lookup = {'GRADE LEVEL': pd.Series(['ELEMENTARY','MIDDLE/HIGH', 'MISC']),'LEVEL': pd.Series([1, 2, 3])}
grade_lookup

In [ ]:
grade_lookup2 = pd.DataFrame(grade_lookup)
grade_lookup2

In [ ]:
# Primeros 5 elementos del campo GRADE LEVEL
df['GRADE LEVEL'].unique()

In [ ]:
df

In [ ]:
# Inner Join
d_sub = df.join(grade_lookup2.set_index(['GRADE LEVEL']), on=['GRADE LEVEL'], how='inner')
d_sub

In [ ]:
#Left Join.
d_sub = df.join(grade_lookup2.set_index(['GRADE LEVEL']), on=['GRADE LEVEL'], how='left')
d_sub

In [ ]:
#Full Outer Join.
d_sub = df.join(grade_lookup2.set_index(['GRADE LEVEL']),on=['GRADE LEVEL'], how='outer')
d_sub

In [ ]:
#Método merge
d_sub = pd.merge(df, grade_lookup2, on=['GRADE LEVEL'], how='outer')
d_sub

In [ ]:
d_sub = pd.merge(df, grade_lookup2, left_on=['GRADE LEVEL'], right_on=['GRADE LEVEL'], how='inner')
d_sub

In [ ]:
d_sub = pd.merge(df, grade_lookup2.set_index(['GRADE LEVEL']), left_on=['GRADE LEVEL'], right_index=True, how='inner')
d_sub

In [ ]:
d_sub = pd.merge(df.set_index(['GRADE LEVEL']), grade_lookup2, left_index=True, right_on=['GRADE LEVEL'], how='inner')
d_sub

In [ ]:
d_sub = pd.merge(df.set_index(['GRADE LEVEL']), grade_lookup2.set_index(['GRADE LEVEL']), left_index=True, right_index=True, how='inner')
d_sub

# Extra 3:

## Agrupaciones en un DataFrame

In [ ]:
df

In [ ]:
# Group By
df.groupby('GRADE LEVEL')['NO. OBESE'].sum()

In [ ]:
df.groupby('GRADE LEVEL')['NO. OBESE'].mean()

In [ ]:
df.groupby('GRADE LEVEL')['NO. OBESE'].std()

In [ ]:
df.groupby('GRADE LEVEL')['NO. OBESE'].aggregate(sum)

In [ ]:
df.groupby('GRADE LEVEL')['NO. OBESE'].agg(sum)

In [ ]:
df.groupby('GRADE LEVEL')['NO. OBESE'].agg(suma = sum)

In [ ]:
df.groupby(['COUNTY','GRADE LEVEL'])['NO. OBESE'].agg(suma = sum)

In [ ]:
df.groupby('GRADE LEVEL').agg(suma_NO_OBESES = ('NO. OBESE', sum),
                              count_NO_OBESES = ('NO. OVERWEIGHT', len))

In [ ]:
df.groupby(['COUNTY','GRADE LEVEL']).agg(suma_NO_OBESES = ('NO. OBESE', sum),
                                         count_NO_OBESES = ('NO. OVERWEIGHT', len))